{
  "welcome": {
    "subject": "Thanks for reaching out, {{firstName}}",
    "content": "Hi {{firstName}},\n\nThanks for contacting Hudson Digital Solutions about {{service}}. I'm Richard, and I'll be personally handling your inquiry.\n\nI've reviewed your message and I'm excited about the potential to help {{company}} achieve its goals.\n\nYou can expect a detailed response from me within the next 24 hours. In the meantime, I'd love to learn more about your specific needs.\n\nWhat's the biggest challenge you're facing right now with {{service}}?\n\nBest regards,\nRichard Hudson\nFounder, Hudson Digital Solutions\n\nP.S. - If your project is urgent, you can book a same-day call here: https://hudsondigitalsolutions.com/contact"
  },
  "consultation": {
    "subject": "{{firstName}}, let's discuss your {{service}} project",
    "content": "Hi {{firstName}},\n\nI wanted to reach out personally about your {{service}} inquiry for {{company}}.\n\nBased on what you've shared, I see several opportunities where we could make a significant impact. I'd love to discuss:\n\n• Your specific goals and challenges\n• Potential solutions tailored to {{company}}\n• Timeline and next steps\n• Expected ROI and outcomes\n\nI've reserved a few consultation slots this week. These are complimentary 30-minute strategy sessions where we'll map out exactly how to achieve your goals.\n\nBook your slot: https://hudsondigitalsolutions.com/contact\n\nOr just reply with your availability, and I'll send a calendar invite.\n\nLooking forward to speaking with you!\n\nBest,\nRichard Hudson\nFounder, Hudson Digital Solutions\nPhone: Available via calendar\n\nP.S. - I come to every consultation prepared with specific recommendations for your business. No generic pitches."
  },
  "follow-up": {
    "subject": "Following up on {{service}} for {{company}}",
    "content": "Hi {{firstName}},\n\nI wanted to follow up on your inquiry about {{service}}. I know you're busy, so I'll keep this brief.\n\nAre you still looking for help with your project? If so, I'd love to chat.\n\nIf now isn't the right time, no worries at all. Just let me know when would be better, and I'll follow up then.\n\nEither way, I'd appreciate a quick reply so I know where things stand.\n\nBest,\nRichard Hudson\n\nP.S. - If you have any questions before scheduling a call, feel free to reply to this email. I'm happy to answer them."
  },
  "calculator-hot-lead": {
    "subject": "High-priority: Your {{calculatorType}} results analysis",
    "content": "Hi {{firstName}},\n\nI personally reviewed your {{calculatorType}} results, and I wanted to reach out immediately.\n\nBased on your data, I see significant opportunity for improvement - the kind of numbers that can transform a business.\n\nI've worked with dozens of companies in similar situations, and I know exactly how to help you achieve those results.\n\nHere's what I'd like to do:\n\n1. Have a 15-minute call this week\n2. Show you specific strategies that have worked for similar businesses\n3. Map out a clear plan to achieve your target numbers\n\nNo pressure, no hard sell. Just practical insights from someone who's done this many times before.\n\nBook directly: https://hudsondigitalsolutions.com/contact\n\nOr reply with your availability, and I'll send a calendar invite.\n\nBest,\nRichard Hudson\nFounder, Hudson Digital Solutions\n\nP.S. - I'm currently working with 3 clients who started with similar calculator results. Happy to share their success stories on the call."
  },
  "calculator-follow-up": {
    "subject": "Ready to improve your {{calculatorType}}?",
    "content": "Hi {{firstName}},\n\nYou recently used our {{calculatorType}} and saw some exciting potential.\n\nI wanted to check in - are you still thinking about improving these numbers?\n\nWe specialize in helping businesses like {{company}} achieve measurable results. Here's what we typically see:\n\n• 15-50% conversion rate improvements\n• 2-3x faster load times\n• Higher customer satisfaction and retention\n• Improved SEO rankings and organic traffic\n\nThe best part? We can usually start seeing results within 4-6 weeks.\n\nInterested in a quick conversation about next steps?\n\nSchedule a call: https://hudsondigitalsolutions.com/contact\n\nBest,\nRichard Hudson\nFounder, Hudson Digital Solutions\n\nP.S. - If timing isn't right yet, no problem. Just reply and let me know when would be better. I'll follow up then."
  },
  "roi-calculator-value": {
    "subject": "The hidden costs of low conversion rates",
    "content": "Hi {{firstName}},\n\nWhen you used our ROI Calculator, you saw potential for significant revenue growth for {{company}}.\n\nBut here's what most people don't realize:\n\nEvery day you wait is another day of lost revenue. If your calculator showed potential for additional annual revenue, that compounds quickly.\n\nThe good news? Conversion optimization is one of the fastest ROI improvements we deliver.\n\nTypical timeline:\n• Week 1-2: Analysis and quick wins (often 10-15% improvement)\n• Week 3-4: Implementation of major optimizations\n• Week 5-6: A/B testing and refinement\n• Week 7+: Measuring and scaling results\n\nMany of our clients see positive ROI within 60 days.\n\nReady to stop leaving money on the table?\n\nLet's talk: https://hudsondigitalsolutions.com/contact\n\nBest,\nRichard Hudson\nFounder, Hudson Digital Solutions\n\nP.S. - Our average client sees 2.5x ROI in the first year. I'd love to show you how we achieve these results."
  },
  "cost-estimator-next-steps": {
    "subject": "Your website project roadmap",
    "content": "Hi {{firstName}},\n\nThanks for using our Website Cost Estimator for {{company}}!\n\nNow that you have a ballpark estimate, let's talk about the next steps to turn this into reality.\n\nHere's our proven project process:\n\n1. Discovery Call (30 min) - Understand your goals and requirements\n2. Detailed Proposal - Exact pricing, timeline, and deliverables\n3. Design Phase - Mockups and prototypes for your approval\n4. Development - Building your custom solution\n5. Launch & Support - Go live and ongoing optimization\n\nThe best part? We can usually start within 1-2 weeks of signing.\n\nWhat sets us apart:\n- Clear communication throughout\n- No surprise costs or scope creep\n- Built-in performance optimization\n- Ongoing support and training\n\nWant to discuss your specific project?\n\nSchedule your discovery call: https://hudsondigitalsolutions.com/contact\n\nBest,\nRichard Hudson\nFounder, Hudson Digital Solutions\n\nP.S. - Mention this email and get a free performance optimization package ($1,500 value) included with your project."
  },
  "performance-calculator-urgency": {
    "subject": "Your website is costing you money every month",
    "content": "Hi {{firstName}},\n\nYour Performance Calculator results showed that {{company}}'s website is potentially losing significant revenue due to slow performance.\n\nHere's why this matters:\n\n• Google found that 53% of mobile users abandon sites that take longer than 3 seconds to load\n• A 1-second delay in page load time can reduce conversions by 7%\n• Slow sites rank lower in search results, reducing organic traffic\n• Poor performance damages your brand reputation\n\nThe good news? Performance optimization is usually one of our quickest wins:\n\n- Faster implementation (2-4 weeks typical)\n- Immediate measurable results\n- Compounds over time as you get more traffic\n- Improves SEO rankings (Google prioritizes fast sites)\n- Better user experience = higher conversions\n\nWe specialize in getting websites from poor performance to 90+ scores, and we've done it hundreds of times.\n\nWant to see a detailed performance audit of your site?\n\nSchedule a call: https://hudsondigitalsolutions.com/contact\n\nBest,\nRichard Hudson\nFounder, Hudson Digital Solutions\n\nP.S. - I'll personally review your site before our call and come prepared with specific recommendations."
  },
  "long-term-nurture": {
    "subject": "Quick check-in from Hudson Digital",
    "content": "Hi {{firstName}},\n\nI wanted to touch base and see how things are going with {{company}}.\n\nI know when we last spoke, the timing wasn't quite right for {{service}}. That's totally understandable - these decisions need to align with your business priorities.\n\nI'm reaching out because I want to make sure you have the resources you need, whether you work with us or not.\n\nHere are a few things that might be helpful:\n\n• Free blog posts and guides on our website\n• Monthly newsletter with practical tips (no fluff)\n• Access to our free calculators and tools\n• Case studies showing what's possible\n\nNo pressure at all. I just want to stay on your radar for when the timing is right.\n\nIs there anything specific I can help you with right now?\n\nBest,\nRichard Hudson\n\nP.S. - If you'd prefer I stop following up, just let me know. No hard feelings!"
  },
  "case-study-showcase": {
    "subject": "How we helped a business like {{company}}",
    "content": "Hi {{firstName}},\n\nI thought you might find this interesting - we recently completed a project very similar to what you're looking for.\n\nThe client was facing similar challenges:\n\n• Needed to improve {{service}}\n• Wanted measurable results, not just pretty designs\n• Had budget and timeline constraints\n\nHere's what we achieved:\n\n- 3x increase in qualified leads\n- 45% improvement in conversion rate\n- 2.5x ROI in first year\n- Project completed on time and under budget\n\nI'd love to share the full case study with you, including:\n\n• The specific strategies we used\n• Timeline and implementation details\n• Exact results and metrics\n• Client testimonial and video interview\n\nWant to see how we did it?\n\nView the case study: https://hudsondigitalsolutions.com/case-studies\n\nOr schedule a call and I'll walk you through it personally: https://hudsondigitalsolutions.com/contact\n\nBest,\nRichard Hudson\n\nP.S. - Every project is different, but the principles we used could definitely apply to {{company}}."
  },
  "re-engagement": {
    "subject": "Still interested in {{service}}?",
    "content": "Hi {{firstName}},\n\nIt's been a while since we last connected about {{service}} for {{company}}.\n\nI wanted to reach out one more time because I genuinely believe we could help you achieve your goals.\n\nA lot has happened since we last spoke:\n\n• We've completed 15+ successful projects\n• Added new services and capabilities\n• Developed faster implementation processes\n• Lowered our minimum project size\n\nMaybe some of these changes make working together more feasible now?\n\nI'd love to reconnect if you're still interested. If not, no worries - I'll stop following up.\n\nEither way, I'd appreciate knowing where things stand.\n\nStill interested? Book a call: https://hudsondigitalsolutions.com/contact\n\nReady to pass? Just reply \"not interested\" and I'll stop reaching out.\n\nBest,\nRichard Hudson\n\nP.S. - Even if you're not ready to work together, I'm happy to answer any questions you have about {{service}}. No strings attached."
  },
  "final-outreach": {
    "subject": "Last message from me",
    "content": "Hi {{firstName}},\n\nThis will be my last message unless you reach out first.\n\nI've really enjoyed learning about {{company}} and what you're trying to achieve with {{service}}.\n\nI understand that now might not be the right time, and that's perfectly okay. Business priorities change, budgets shift, and timing matters.\n\nI just wanted to say:\n\n• My door is always open if you want to reconnect\n• You can reach me anytime at hello@hudsondigitalsolutions.com\n• All our resources (calculators, guides, blog posts) remain free for you to use\n• I'm happy to answer questions even if you never become a client\n\nI genuinely hope {{company}} achieves everything you're working toward.\n\nIf I can ever help - even just with advice or a referral - please don't hesitate to reach out.\n\nBest of luck with everything!\n\nRichard Hudson\nFounder, Hudson Digital Solutions\n\nP.S. - Seriously, feel free to email me even if it's just a question. I love talking shop about {{service}} and helping people succeed."
  }
}
